grblHAL/ESP32/main/driver.c
    if(IOInitDone) {

      #if VFD_SPINDLE != 1
        hal.spindle.set_state = hal.driver_cap.variable_spindle ? spindleSetStateVariable : spindleSetState;
      #endif

#if BLUETOOTH_ENABLE
        static bool bluetooth_ok = false;
        if(!bluetooth_ok)
            bluetooth_ok = bluetooth_start();
        // else report error?
#endif

#if WIFI_ENABLE

        static bool wifi_ok = false;

        if(!wifi_ok)
            wifi_ok = wifi_start();

        // TODO: start/stop services...
#endif

        stepperEnable(settings->steppers.deenergize);

        /*********************
         * Step pulse config *
         *********************/

#ifdef USE_I2S_OUT
        i2s_step_length = (uint32_t)(settings->steppers.pulse_microseconds);
        if(i2s_step_length < I2S_OUT_USEC_PER_PULSE)
            i2s_step_length = I2S_OUT_USEC_PER_PULSE;
        i2s_step_samples = i2s_step_length / I2S_OUT_USEC_PER_PULSE; // round up?
#else
        initRMT(settings);
#endif

        /****************************************
         *  Control, limit & probe pins config  *
         ****************************************/

        bool pullup = true;
        control_signals_t control_fei;
        gpio_config_t config;
        input_signal_t *signal;

        control_fei.mask = settings->control_disable_pullup.mask ^ settings->control_invert.mask;

        axes_signals_t limit_fei;
        limit_fei.mask = settings->limits.disable_pullup.mask ^ settings->limits.invert.mask;

        uint32_t i = sizeof(inputpin) / sizeof(input_signal_t);

        do {

            signal = &inputpin[--i];   
            config.intr_type = GPIO_INTR_DISABLE;

            switch(signal->id) {

                case Input_Reset:
                    pullup = !settings->control_disable_pullup.reset;
                    signal->invert = control_fei.reset;
                    break;

                case Input_FeedHold:
                    pullup = !settings->control_disable_pullup.feed_hold;
                    signal->invert = control_fei.feed_hold;
                    break;

                case Input_CycleStart:
                    pullup = !settings->control_disable_pullup.cycle_start;
                    signal->invert = control_fei.cycle_start;
                    break;

                case Input_SafetyDoor:
                    pullup = !settings->control_disable_pullup.safety_door_ajar;
                    signal->invert = control_fei.safety_door_ajar;
                    break;

                case Input_Probe:
                    pullup = hal.driver_cap.probe_pull_up;
                    signal->invert = false;
                    break;

                case Input_LimitX:
                case Input_LimitX_2:
                case Input_LimitX_Max:
                    pullup = !settings->limits.disable_pullup.x;
                    signal->invert = limit_fei.x;
                    break;

                case Input_LimitY:
                case Input_LimitY_2:
                case Input_LimitY_Max:
                    pullup = !settings->limits.disable_pullup.y;
                    signal->invert = limit_fei.y;
                    break;

                case Input_LimitZ:
                case Input_LimitZ_2:
                case Input_LimitZ_Max:
                    pullup = !settings->limits.disable_pullup.z;
                    signal->invert = limit_fei.z;
                   break;
#ifdef A_LIMIT_PIN
                case Input_LimitA:
                    pullup = !settings->limits.disable_pullup.a;
                    signal->invert = limit_fei.a;
                    break;
#endif
#ifdef B_LIMIT_PIN
                case Input_LimitB:
                    pullup = !settings->limits.disable_pullup.b;
                    signal->invert = limit_fei.b;
                    break;
#endif
#ifdef C_LIMIT_PIN
                case Input_LimitC:
                    pullup = !settings->limits.disable_pullup.c;
                    signal->invert = limit_fei.c;
                    break;
#endif
#if MPG_MODE_ENABLE
                case Input_ModeSelect:
                    pullup = true;
                    signal->invert = false;
                    config.intr_type = GPIO_INTR_ANYEDGE;
                    break;
#endif
#if I2C_STROBE_ENABLE
                case Input_KeypadStrobe:
                    pullup = true;
                    signal->invert = false;
                    config.intr_type = GPIO_INTR_ANYEDGE;
                    break;
#endif
                default:
                    break;
            }

            switch(signal->group) {

                case PinGroup_Control:
                    config.intr_type = signal->invert ? GPIO_INTR_NEGEDGE : GPIO_INTR_POSEDGE;
                    break;

                case PinGroup_Limit:
                    signal->intr_type = signal->invert ? GPIO_INTR_NEGEDGE : GPIO_INTR_POSEDGE;
                    break;

                default:
                    break;
            }

            if(signal->pin != 0xFF) {

                gpio_intr_disable(signal->pin);

                config.pin_bit_mask = 1ULL << signal->pin;
                config.mode = GPIO_MODE_INPUT;
                config.pull_up_en = pullup && signal->pin < 34 ? GPIO_PULLUP_ENABLE : GPIO_PULLUP_DISABLE;
                config.pull_down_en = pullup || signal->pin >= 34 ? GPIO_PULLDOWN_DISABLE : GPIO_PULLDOWN_ENABLE;

                signal->offset = config.pin_bit_mask > (1ULL << 31) ? 1 : 0;
                signal->mask = signal->offset == 0 ? (uint32_t)config.pin_bit_mask : (uint32_t)(config.pin_bit_mask >> 32);

    //            printf("IN %d - %d - %d : %x\n", signal->pin,  signal->offset, signal->mask, signal->invert);

                gpio_config(&config);

                signal->active   = gpio_get_level(signal->pin) == (signal->invert ? 0 : 1);
                signal->debounce = hal.driver_cap.software_debounce && !(signal->group == PinGroup_Probe || signal->group == PinGroup_Keypad || signal->group == PinGroup_MPG);
            }
        } while(i);

