grblHAL/ESP32/main/driver.c
    hal.periph_port.register_pin(&sck);
    hal.periph_port.register_pin(&sdo);
    hal.periph_port.register_pin(&sdi);

#endif

#if IOEXPAND_ENABLE
    ioexpand_init();
#endif

#if WEBUI_ENABLE
    webui_init();
#endif

  // Set defaults

    IOInitDone = settings->version == 21;

    hal.settings_changed(settings);
    hal.stepper.go_idle(true);

    return IOInitDone;
}

// Initialize HAL pointers, setup serial comms and enable EEPROM
// NOTE: Grbl is not yet configured (from EEPROM data), driver_setup() will be called when done
bool driver_init (void)
{
    // Enable EEPROM and serial port here for Grbl to be able to configure itself and report any errors

    static char idf[48];

    strcpy(idf, esp_get_idf_version());

    hal.info = "ESP32";
    hal.driver_version = "211127";
#ifdef BOARD_NAME
    hal.board = BOARD_NAME;
#endif
    hal.driver_options = IDF_VER;
    hal.driver_setup = driver_setup;
    hal.f_step_timer = rtc_clk_apb_freq_get() / STEPPER_DRIVER_PRESCALER; // 20 MHz
    hal.rx_buffer_size = RX_BUFFER_SIZE;
    hal.delay_ms = driver_delay_ms;
    hal.settings_changed = settings_changed;

#ifndef USE_I2S_OUT
    hal.stepper.wake_up = stepperWakeUp;
    hal.stepper.go_idle = stepperGoIdle;
    hal.stepper.enable = stepperEnable;
    hal.stepper.cycles_per_tick = stepperCyclesPerTick;
    hal.stepper.pulse_start = stepperPulseStart;
#else
    hal.stepper.wake_up = I2S_stepperWakeUp;
    hal.stepper.go_idle = I2S_stepperGoIdle;
    hal.stepper.enable = stepperEnable;
    hal.stepper.cycles_per_tick = I2S_stepperCyclesPerTick;
    hal.stepper.pulse_start = I2S_stepperPulseStart;
    i2s_out_init();
    i2s_out_set_pulse_callback(hal.stepper.interrupt_callback);
#endif

    hal.limits.enable = limitsEnable;
    hal.limits.get_state = limitsGetState;

    hal.coolant.set_state = coolantSetState;
    hal.coolant.get_state = coolantGetState;

#ifdef PROBE_PIN
    hal.probe.get_state = probeGetState;
    hal.probe.configure = probeConfigure;
#endif

#if VFD_SPINDLE != 1
    hal.spindle.set_state = spindleSetState;
    hal.spindle.get_state = spindleGetState;
  #ifdef SPINDLE_PWM_DIRECT
    hal.spindle.get_pwm = spindleGetPWM;
    hal.spindle.update_pwm = spindle_set_speed;
  #else
    hal.spindle.update_rpm = spindleUpdateRPM; // NOTE: fails in laser mode as ESP32 does not handle FPU access in ISRs!
  #endif
#endif

    hal.control.get_state = systemGetState;

//    hal.reboot = esp_restart; crashes the MCU...
    hal.irq_enable = enable_irq;
    hal.irq_disable = disable_irq;
#if I2C_STROBE_ENABLE
    hal.irq_claim = irq_claim;
#endif
    hal.set_bits_atomic = bitsSetAtomic;
    hal.clear_bits_atomic = bitsClearAtomic;
    hal.set_value_atomic = valueSetAtomic;
    hal.get_elapsed_ticks = xTaskGetTickCountFromISR;
    hal.enumerate_pins = enumeratePins;
    hal.periph_port.register_pin = registerPeriphPin;
    hal.periph_port.set_pin_description = setPeriphPinDescription;

    serial_stream = serialInit(115200);

    hal.stream_select = selectStream;
    hal.stream_select(serial_stream);

#if I2C_ENABLE
    I2CInit();
#endif

#if EEPROM_ENABLE
    i2c_eeprom_init();
#else
    if(nvsInit()) {
        hal.nvs.type = NVS_Flash;
        hal.nvs.memcpy_from_flash = nvsRead;
        hal.nvs.memcpy_to_flash = nvsWrite;
    } else
        hal.nvs.type = NVS_None;
#endif

#ifdef DEBUGOUT
    hal.debug_out = debug_out;
#endif

#if WIFI_ENABLE
    grbl.on_report_options = reportConnection;
#endif

  // driver capabilities, used for announcing and negotiating (with Grbl) driver functionality

#if VFD_SPINDLE != 1
  #if IOEXPAND_ENABLE || defined(SPINDLE_DIRECTION_PIN)
    hal.driver_cap.spindle_dir = On;
  #endif
    hal.driver_cap.variable_spindle = On;
    hal.driver_cap.spindle_pwm_invert = On;
  #if PWM_RAMPED
    hal.driver_cap.spindle_at_speed = On;
  #endif
  #if IOEXPAND_ENABLE || defined(COOLANT_MIST_PIN)
    hal.driver_cap.mist_control = On;
  #endif
#endif
    hal.driver_cap.software_debounce = On;
    hal.driver_cap.step_pulse_delay = On;
    hal.driver_cap.amass_level = 3;
    hal.driver_cap.control_pull_up = On;
    hal.driver_cap.limits_pull_up = On;
    hal.driver_cap.probe_pull_up = On;
#ifdef SAFETY_DOOR_PIN
    hal.signals_cap.safety_door_ajar = On;
#endif
#if MPG_MODE_ENABLE
    hal.driver_cap.mpg_mode = On;
    mpg_stream = serial2Init(115200);
#endif

    uint32_t i;
    static pin_group_pins_t aux_outputs = {0};
    output_signal_t *output;

    for(i = 0 ; i < sizeof(outputpin) / sizeof(output_signal_t); i++) {
        output = &outputpin[i];
        if(output->group == PinGroup_AuxOutput) {
            if(aux_outputs.pins.outputs == NULL)
                aux_outputs.pins.outputs = output;
            aux_outputs.n_pins++;
        }
    }

    if(aux_outputs.n_pins)
        ioports_init(NULL, &aux_outputs);

#if WIFI_ENABLE
    wifi_init();
#endif

#if BLUETOOTH_ENABLE
    bluetooth_init();
#endif

serialRegisterStreams();

#include "grbl/plugins_init.h"

    // no need to move version check before init - compiler will fail any mismatch for existing entries
    return hal.version == 9;
}

/* interrupt handlers */

// Main stepper driver
IRAM_ATTR static void stepper_driver_isr (void *arg)
{
    TIMERG0.int_clr_timers.t0 = 1;
    TIMERG0.hw_timer[STEP_TIMER_INDEX].config.alarm_en = TIMER_ALARM_EN;

    hal.stepper.interrupt_callback();
}

  //GPIO intr process
IRAM_ATTR static void gpio_isr (void *arg)
{
    bool debounce = false;
    uint32_t grp = 0, intr_status[2];
    intr_status[0] = READ_PERI_REG(GPIO_STATUS_REG);          // get interrupt status for GPIO0-31
    intr_status[1] = READ_PERI_REG(GPIO_STATUS1_REG);         // get interrupt status for GPIO32-39
    SET_PERI_REG_MASK(GPIO_STATUS_W1TC_REG, intr_status[0]);  // clear intr for gpio0-gpio31
    SET_PERI_REG_MASK(GPIO_STATUS1_W1TC_REG, intr_status[1]); // clear intr for gpio32-39

    uint32_t i = sizeof(inputpin) / sizeof(input_signal_t);
    do {
        i--;
        if(intr_status[inputpin[i].offset] & inputpin[i].mask) {
            inputpin[i].active = true;
            if(inputpin[i].debounce)
                debounce = true;
            else
                grp |= inputpin[i].group;
        }
    } while(i);

    if(debounce) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xTimerStartFromISR(debounceTimer, &xHigherPriorityTaskWoken);
    }

    if(grp & PinGroup_Limit)
        hal.limits.interrupt_callback(limitsGetState());

    if(grp & PinGroup_Control)
        hal.control.interrupt_callback(systemGetState());

#if MPG_MODE_ENABLE

    static bool mpg_mutex = false;

    if((grp & PinGroup_MPG) && !mpg_mutex) {
        mpg_mutex = true;
        modeChange();
        // hal.delay_ms(50, modeChange); // causes intermittent panic... stacked calls due to debounce?
        mpg_mutex = false;
    }
#endif

#if I2C_STROBE_ENABLE
    if((grp & PinGroup_Keypad) && i2c_strobe.callback)
        i2c_strobe.callback(0, gpio_get_level(I2C_STROBE_PIN));
#endif
}
